### Terraform - Terraform plan Succeeded
<details><summary>Show Output</summary>
<p>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.vnet_main will be created
+   resource "azurerm_resource_group" "vnet_main" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "main-vnet"
    }

  # module.vnet-main.data.azurerm_resource_group.vnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "vnet" {
+       id       = (known after apply)
+       location = (known after apply)
+       name     = "main-vnet"
+       tags     = (known after apply)

+       timeouts {
+           read = (known after apply)
        }
    }

  # module.vnet-main.azurerm_subnet.subnet[0] will be created
+   resource "azurerm_subnet" "subnet" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.0.0.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "web"
+       resource_group_name                            = "main-vnet"
+       virtual_network_name                           = "main-vnet"
    }

  # module.vnet-main.azurerm_subnet.subnet[1] will be created
+   resource "azurerm_subnet" "subnet" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.0.1.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "database"
+       resource_group_name                            = "main-vnet"
+       virtual_network_name                           = "main-vnet"
    }

  # module.vnet-main.azurerm_virtual_network.vnet will be created
+   resource "azurerm_virtual_network" "vnet" {
+       address_space         = [
+           "10.0.0.0/16",
        ]
+       dns_servers           = []
+       guid                  = (known after apply)
+       id                    = (known after apply)
+       location              = (known after apply)
+       name                  = "main-vnet"
+       resource_group_name   = "main-vnet"
+       subnet                = (known after apply)
+       tags                  = {
+           "costcenter"  = "it"
+           "environment" = "dev"
        }
+       vm_protection_enabled = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   vnet_id = (known after apply)
```

</p>
</details>